{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/analog-redstone-suite",
  "promos": {
    "1.20.1-latest": "1.20.1-0.6.0",
    "1.20.1-recommended": "1.20.1-0.6.0",
    "1.19.2-latest": "1.19.2-B1.0",
    "1.19.2-recommended": "1.19.2-B1.0",
    "1.18.2-latest": "1.18.2-B1.7",
    "1.18.2-recommended": "1.18.2-B1.7"
  },
  "1.20.1": {
    "1.20.1-0.6.0": "Added Sequencer (make complex sequences of redstone power with this new gate), Sequencer Record (store the memory of a sequencer to copy it from Sequencer to Sequencer, or copy to/from clip board), Precise Dispenser (dispenser with aiming mechanics, using analog redstone inputs) and Pixel (Block who's color change based on redstone input).",
    "1.20.1-0.5.0": "Added 2 items: the Keyboard (remote control power sources via keyboard or MIDI inputs) and the Redstone Booster (allow some blocks and most diodes to work using 1 minecraft tick instead of 1 redstone tick, or twice as fast).",
    "1.20.1-0.4.0": "Fixed 1 tick pulse behavior on diodes, fixed unplayable 0 (lowest) note on analog noteblock, fixed noteblock playing on any block update, analog redstone lamp are now immediate (power off immediately instead of waiting 2 redstone ticks), added a way to disable some inputs on diodes by using a redstone torch, added camouflage setting (shift rightclick with torch) to lamp, note block, jukebox and redstone block. Fixed delayer having behavior not matching the texture displayed.",
    "1.20.1-0.3.0": "Fixed many bugs on the Jukebox, added back the documentation on tooltips, added Instrument Swapper block, added 'Sculk Vibrations' book, added vanilla parity for the Analog Note Block (can be played manually with left click), fixed broken tick delay on diodes (making most of them taking 2 ticks instead of 1 to update).",
    "1.20.1-0.2.0": "Ported to neo forge, changed version naming convention, jukebox now emit particles (like vanilla) and start playing on inserting if redstone matches the slot.",
    "1.20.1-B1.8": "Ported to 1.20.1, jukebox stop the record (as intended) when selecting an empty slot, shift-click in a jukebox is fixed."
  },
  "1.19.2": {
    "1.19.2-B1.0": "Ported to 1.19.2, now requires my library: LimLib. Moved help from tooltips to JEI info tab. Fixed most bugs and oversights. Added compatibility with The One Probe. Added french translation."
  },
  "1.18.2": {
    "1.18.2-B1.7": "Fixed bug making The One Probe obligatory (instead of facultative), bumped forge version to 40.2.1",
    "1.18.2-B1.6": "Standardisation of version naming, back port of 1.19.2 version, with a fix for diodes trying to generate a signal above 15. Now requires lim_lib version 1.18.2-B1.1.",
    "B1.5": "Bug fixes (Analog Jukebox): Non disc item can no longer be inserted. Disc stop playing when removed via hopper/pipe.",
    "B1.4": "Bug fixes: Removed invalid client calls server side. Fixed missing particles. Fixed missing tool type for breaking some blocks.",
    "B1.3": "Bug fixe: added missing loot tables to comparator and note block.",
    "B1.2": "Fixed the jukebox not having a craft. Added a screen to manipulate the discs inside a jukebox.",
    "B1.1": "Bug fixe: Removed invalid client call server side.",
    "B1.0": "Added crafts, icons, models. Fixed Analog Note Block missing some updates. Added new mode to signal generator. Scrollable block can be locked. Added help/documentation on all items via tooltip. Key (while hold) to scroll blocks is now assignable in the keybind menu.",
    "A1.0": "Here be dragons"
  }
}